In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('coffee_shop_sales.csv')
df.head()

,transaction_id,transaction_date,transaction_time,transaction_qty,store_id,store_location,product_id,unit_price,product_category,product_type,product_detail
0,1,1/1/2023,7:06:11,2,5,Lower Manhattan,32,3.0,Coffee,Gourmet brewed coffee,Ethiopia Rg
1,2,1/1/2023,7:08:56,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg
2,3,1/1/2023,7:14:04,2,5,Lower Manhattan,59,4.5,Drinking Chocolate,Hot chocolate,Dark chocolate Lg
3,4,1/1/2023,7:20:24,1,5,Lower Manhattan,22,2.0,Coffee,Drip coffee,Our Old Time Diner Blend Sm
4,5,1/1/2023,7:22:41,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg

In [16]:
pd_date_obj = pd.to_datetime(df['transaction_date'])
pd_date_obj = pd.to_datetime(df['transaction_date'])

if 'day_name' in df.columns:
    df.drop('day_name', axis=1, inplace=True)

day_name = pd_date_obj.dt.day_name()

df.insert(2, 'day_name', day_name)

product_detail_day_grp = df.groupby('day_name')['transaction_qty'].sum()
print(product_detail_day_grp.idxmax(),product_detail_day_grp.max())

Monday 31231

In [4]:
product_detail_grp = df.groupby('product_detail')['transaction_qty'].sum()
max_sold_product = product_detail_grp.idxmax()
min_sold_product = product_detail_grp.idxmin()

print(max_sold_product, product_detail_grp.max())
print(min_sold_product, product_detail_grp.min())

Earl Grey Rg 4708
Dark chocolate 118